{
  "10p10w": [{
    "name": "Heropedia",
    "iconUrl": "../../assets/1.png",
    "url": "https://heropedia.imfast.io/",
    "description": "This was the 1st site I did. I kept it super simple. It is a list of some characters in an anime called My Hero Academia."
  }, {
    "name": "Stock Chart Generator",
    "iconUrl": "../../assets/2.png",
    "url": "https://stockgenerator.imfast.io/",
    "description": "This site generates a random stock chart that looks real. It uses GDP data and gaussian distribution to randomly generate the next day's prices. It keeps track of its own daily volatility (std dev) for the gaussian dist. I kind of cheated on this one - I took the logic for generating the prices from an old project of mine and just reskined it."
  }, {
    "name": "Design System",
    "iconUrl": "../../assets/3.png",
    "url": "https://design-dictionary-docs.web.app/",
    "description": "This is a simple design system built with Reactjs that makes use of design tokens generated by styles dictionary by Amazon. The tokens are JSON formats and can be converted to any format of style sheets and for any platform."
  }, {
    "name": "Company Website",
    "iconUrl": "../../assets/4.png",
    "url": "https://door-and-window-solutions.web.app/",
    "description": "This is simple company website made with pure HTML, CSS and JS. (with some cools effects that I wanted to try)"
  }, {
    "name": "Cost of Living Calculator",
    "iconUrl": "../../assets/5.png",
    "url": "https://cost-of-living-calculator.web.app/",
    "description": "This is a calculator that scrapes numbeo.com to estimates if your income will be sufficient to live at a certain location. You can customize your living situation depending on how many family members you have or if you're renting or have a mortgage."
  }, {
    "name": "Flash Cards",
    "iconUrl": "../../assets/6.png",
    "url": "https://flash-cardster.web.app/",
    "description": "This is just flash cards. You can use it to revise for exams or create a quiz. It comes with 2 presets which you can load. These are country flag quiz and country capital quiz."
  }, {
    "name": "Random Birth",
    "iconUrl": "../../assets/7.png",
    "url": "https://random-birth.web.app/",
    "description": "Have you ever wondered what would happen if you were born again to a different family. Now you can find out with this random birth simulator. It takes the birthrate of all the countries in the world and randomly allocates you. Depending on the countries income you will also find out if your family is rich or poor."
  }, {
    "name": "FPS Trainer",
    "iconUrl": "../../assets/8.png",
    "url": "https://fps-trainer.web.app/",
    "description": "I played a flash game back in the days which was used to train you for first person shooter (FPS) games. All you had to do was click on bubbles that appear randomly. It trains your cursor accuracy and reaction rate. This is a recreation of that game."
  }, {
    "name": "Cosy Fire",
    "iconUrl": "../../assets/9.png",
    "url": "https://cosy-fire.imfast.io/",
    "description": "This was the last project. I was really getting sick of having to commit to this 10 week thing and was glad it's finally over. I went with something simple and fun. A cosy fireplace that explodes."
  }],
  "android": [{
    "name": "",
    "iconUrl": "",
    "url": "",
    "description": ""
  }, {
    "name": "",
    "iconUrl": "",
    "url": "",
    "description": ""
  }, {
    "name": "",
    "iconUrl": "",
    "url": "",
    "description": ""
  }]
}